hrshygoodness/Luminary-Micro-Library/boards/dk-lm3s9b96/usb_dev_keyboard/usb_dev_keyboard.c
//*****************************************************************************
//
// usb_dev_keyboard.c - Main routines for the keyboard example.
//
// Copyright (c) 2008-2010 Texas Instruments Incorporated.  All rights reserved.
// Software License Agreement
// 
// Texas Instruments (TI) is supplying this software for use solely and
// exclusively on TI's microcontroller products. The software is owned by
// TI and/or its suppliers, and is protected under applicable copyright
// laws. You may not combine this software with "viral" open-source
// software in order to form a larger program.
// 
// THIS SOFTWARE IS PROVIDED "AS IS" AND WITH ALL FAULTS.
// NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT
// NOT LIMITED TO, IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE. TI SHALL NOT, UNDER ANY
// CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR CONSEQUENTIAL
// DAMAGES, FOR ANY REASON WHATSOEVER.
// 
// This is part of revision 6594 of the DK-LM3S9B96 Firmware Package.
//
//*****************************************************************************

#include "inc/hw_ints.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "driverlib/debug.h"
#include "driverlib/gpio.h"
#include "driverlib/interrupt.h"
#include "driverlib/sysctl.h"
#include "driverlib/systick.h"
#include "driverlib/usb.h"
#include "grlib/grlib.h"
#include "grlib/widget.h"
#include "usblib/usblib.h"
#include "usblib/usbhid.h"
#include "usblib/usb-ids.h"
#include "usblib/device/usbdevice.h"
#include "usblib/device/usbdhid.h"
#include "usblib/device/usbdhidkeyb.h"
#include "drivers/kitronix320x240x16_ssd2119_8bit.h"
#include "drivers/touch.h"
#include "drivers/set_pinout.h"
#include "usb_keyb_structs.h"
#ifdef DEBUG
#include "utils/uartstdio.h"
#endif

//*****************************************************************************
//
//! \addtogroup example_list
//! <h1>USB HID Keyboard Device (usb_dev_keyboard)</h1>
//!
//! This example application turns the evaluation board into a USB keyboard
//! supporting the Human Interface Device class.  The color LCD display shows a
//! virtual keyboard and taps on the touchscreen will send appropriate key
//! usage codes back to the USB host. Modifier keys (Shift, Ctrl and Alt) are
//! ``sticky'' and tapping them toggles their state. The board status LED is
//! used to indicate the current Caps Lock state and is updated in response to
//! pressing the ``Caps'' key on the virtual keyboard or any other keyboard
//! attached to the same USB host system.
//!
//! The device implemented by this application also supports USB remote wakeup
//! allowing it to request the host to reactivate a suspended bus.  If the bus
//! is suspended (as indicated on the application display), touching the
//! display will request a remote wakeup assuming the host has not
//! specifically disabled such requests.
//
//*****************************************************************************

//*****************************************************************************
//
// Notes about the virtual keyboard definition
//
// The virtual keyboard is defined in terms of rows of keys.  Each row of
// keys may be either a normal alphanumeric row in which all keys are the
// same size and handled in exactly the say way, or a row of "special keys"
// which may have different widths and which have a handler function defined
// for each key.  In the definition used here, g_psKeyboard[] contains 6 rows
// and defines the keyboard at the top level.
//
// The keyboard can be in 1 of 4 states defined by the current shift and
// caps lock state.  For alphanumeric rows, the row definition (tAlphaKeys)
// contain strings representing the key cap characters for each of the keys
// in each of the four states.  Function DrawVirtualKeyboard uses these
// strings and the current state to display the correct key caps.
//
//*****************************************************************************

//*****************************************************************************
//
// Hardware resources related to the LED we use to show the CAPSLOCK state.
//
//*****************************************************************************
#define CAPSLOCK_GPIO_BASE      GPIO_PORTF_BASE
#define CAPSLOCK_GPIO_PIN       GPIO_PIN_3
#define CAPSLOCK_ACTIVE         CAPSLOCK_GPIO_PIN
#define CAPSLOCK_INACTIVE       0

//*****************************************************************************
//
// The system tick timer period.
//
//*****************************************************************************
#define SYSTICKS_PER_SECOND 100
#define SYSTICK_PERIOD_MS (1000 / SYSTICKS_PER_SECOND)

//*****************************************************************************
//
// A structure describing special keys which are not handled the same way as
// all the alphanumeric keys.
//
//*****************************************************************************
typedef struct
{
    //
    // The label string for the key.
    //
    const char *pcLabel;

    //
    // The width of the displayed key in pixels.
    //
    short sWidth;

    //
    // The usage code (if any) associated with this key.
    //
    char cUsageCode;

    //
    // A function to be called when the user presses or releases this key.
    //
    unsigned long (*pfnPressHandler)(short sRow, short sCol, tBoolean bPress);

    //
    // A function to be called to redraw the special key. If NULL, the
    // default redraw handler is used.
    //
    void (*pfnRedrawHandler)(short sCol, short sRow, tBoolean bFocus,
                             tBoolean bPressed, tBoolean bBorder);
} tSpecialKey;

//*****************************************************************************
//
// A list of the states that the keyboard can be in.
//
//*****************************************************************************
typedef enum
{
    //
    // Neither shift nor caps lock is active.
    //
    KEY_STATE_NORMAL,

    //
    // Shift is active, caps lock is not.
    //
    KEY_STATE_SHIFT,

    //
    // Shift is not active, caps lock is active.
    //
    KEY_STATE_CAPS,

    //
    // Both shift and caps lock are active.
    //
    KEY_STATE_BOTH,

    //
    // State counter member.
    //
    NUM_KEY_STATES
} tKeyState;

