hrshygoodness/Luminary-Micro-Library/boards/dk-lm3s9b96/usb_dev_keyboard/usb_dev_keyboard.c
tKeyState g_eVirtualKeyState = KEY_STATE_NORMAL;

//*****************************************************************************
//
// A structure describing typical alphanumeric keys.
//
//*****************************************************************************
typedef struct
{
    //
    // Strings containing the unshifted, shifted and caps representations of
    // each of the keys in the row.
    //
    const char *pcKey[NUM_KEY_STATES];
    const char *pcUsageCodes;
} tAlphaKeys;

//*****************************************************************************
//
// A structure describing a single row of the virtual keyboard.
//
//*****************************************************************************
typedef struct
{
    //
    // Does this row consist of alphanumeric keys or special keys?
    //
    tBoolean bSpecial;

    //
    // Pointer to data describing this row of keys.  If bSpecial is true,
    // this points to an array of tSpecialKey structures.  If bSpecial is
    // false, it points to a single tAlphaKeys structure.
    //
    void *pvKeys;

    //
    // The number of keys in the row.
    //
    short sNumKeys;

    //
    // The horizontal offset to apply when drawing the characters in this
    // row to the screen.  This allows us to offset the rows slightly as they
    // would look on a normal keyboard.
    //
    short sLeftOffset;
} tRow;

//*****************************************************************************
//
// Labels defining the layout of the virtual keyboard on the display.
//
//*****************************************************************************
#define NUM_KEYBOARD_ROWS       6
#define KEYBOARD_TOP            70
#define KEYBOARD_KEY_WIDTH      26
#define KEYBOARD_KEY_HEIGHT     24
#define KEYBOARD_COL_SPACING    2
#define KEYBOARD_ROW_SPACING    4

#define KEYBOARD_CELL_WIDTH     (KEYBOARD_KEY_WIDTH + KEYBOARD_COL_SPACING)
#define KEYBOARD_CELL_HEIGHT    (KEYBOARD_KEY_HEIGHT + KEYBOARD_ROW_SPACING)

//*****************************************************************************
//
// Colors used to draw various parts of the virtual keyboard.
//
//*****************************************************************************
#define FOCUS_COLOR             ClrRed
#define BACKGROUND_COLOR        ClrBlack
#define HIGHLIGHT_COLOR         ClrWhite
#define SHADOW_COLOR            ClrGray
#define KEY_COLOR               0x00E0E0E0
#define KEY_BRIGHT_COLOR        0x00E0E000
#define HIGHLIGHT_BRIGHT_COLOR  ClrYellow
#define SHADOW_BRIGHT_COLOR     0x00808000
#define KEY_TEXT_COLOR          ClrBlack

//*****************************************************************************
//
// Keys on the top row of the virtual keyboard.  Strings are defined showing
// the keycaps in unshifted, shifted and caps states.
//
//*****************************************************************************
#define NUM_ROW0_KEYS 10

const char g_pcRow0UsageCodes[NUM_ROW0_KEYS] =
{
    HID_KEYB_USAGE_1, HID_KEYB_USAGE_2, HID_KEYB_USAGE_3, HID_KEYB_USAGE_4,
    HID_KEYB_USAGE_5, HID_KEYB_USAGE_6, HID_KEYB_USAGE_7, HID_KEYB_USAGE_8,
    HID_KEYB_USAGE_9, HID_KEYB_USAGE_0
};

const tAlphaKeys g_sRow0 =
{
    {"1234567890",  // Normal
     "!@#$%^&*()",  // Shift
     "1234567890",  // Caps
     "!@#$%^&*()"}, // Shift + Caps
    g_pcRow0UsageCodes
};

//*****************************************************************************
//
// Keys on the second row of the virtual keyboard.  Strings are defined showing
// the keycaps in unshifted, shifted and caps states.
//
//*****************************************************************************
#define NUM_ROW1_KEYS 10

const char g_pcRow1UsageCodes[NUM_ROW1_KEYS] =
{
    HID_KEYB_USAGE_Q, HID_KEYB_USAGE_W, HID_KEYB_USAGE_E, HID_KEYB_USAGE_R,
    HID_KEYB_USAGE_T, HID_KEYB_USAGE_Y, HID_KEYB_USAGE_U, HID_KEYB_USAGE_I,
    HID_KEYB_USAGE_O, HID_KEYB_USAGE_P
};

const tAlphaKeys g_sRow1 =
{
    {"qwertyuiop",   // Normal
     "QWERTYUIOP",   // Shift
     "QWERTYUIOP",   // Caps
     "qwertyuiop"},  // Shift + Caps
    g_pcRow1UsageCodes
};

//*****************************************************************************
//
// Keys on the third row of the virtual keyboard.  Strings are defined showing
// the keycaps in unshifted, shifted and caps states.
//
//*****************************************************************************
#define NUM_ROW2_KEYS 10

const char g_pcRow2UsageCodes[NUM_ROW2_KEYS] =
{
    HID_KEYB_USAGE_A, HID_KEYB_USAGE_S, HID_KEYB_USAGE_D, HID_KEYB_USAGE_F,
    HID_KEYB_USAGE_G, HID_KEYB_USAGE_H, HID_KEYB_USAGE_J, HID_KEYB_USAGE_K,
    HID_KEYB_USAGE_L, HID_KEYB_USAGE_SEMICOLON
};

const tAlphaKeys g_sRow2 =
{
    {"asdfghjkl;",  // Normal
     "ASDFGHJKL:",  // Shift
     "ASDFGHJKL;",  // Caps
     "asdfghjkl;"}, // Shift + Caps
    g_pcRow2UsageCodes
};

//*****************************************************************************
//
// Keys on the fourth row of the virtual keyboard.  Strings are defined showing
// the keycaps in unshifted, shifted and caps states.
//
//*****************************************************************************
#define NUM_ROW3_KEYS 10

const char g_pcRow3UsageCodes[NUM_ROW3_KEYS] =
{
 HID_KEYB_USAGE_Z, HID_KEYB_USAGE_X, HID_KEYB_USAGE_C, HID_KEYB_USAGE_V,
 HID_KEYB_USAGE_B, HID_KEYB_USAGE_N, HID_KEYB_USAGE_M, HID_KEYB_USAGE_COMMA,
 HID_KEYB_USAGE_PERIOD, HID_KEYB_USAGE_FSLASH
};

const tAlphaKeys g_sRow3 =
{
    {"zxcvbnm,./",   // Normal
     "ZXCVBNM<>?",   // Shift
     "ZXCVBNM,./",   // Caps
     "zxcvbnm<>?"},  // Shift + Caps
    g_pcRow3UsageCodes
};

//*****************************************************************************
//
// Prototypes for special key handlers
//
//*****************************************************************************
unsigned long CapsLockHandler(short sCol, short sRow, tBoolean bPress);
unsigned long ShiftLockHandler(short sCol, short sRow, tBoolean bPress);
unsigned long CtrlHandler(short sCol, short sRow, tBoolean bPress);
unsigned long AltHandler(short sCol, short sRow, tBoolean bPress);
unsigned long GUIHandler(short sCol, short sRow, tBoolean bPress);
unsigned long DefaultSpecialHandler(short sCol, short sRow, tBoolean bPress);
void CapsLockRedrawHandler(short sCol, short sRow, tBoolean bFocus,
                           tBoolean bPressed, tBoolean bBorder);
void ShiftLockRedrawHandler(short sCol, short sRow, tBoolean bFocus,
                            tBoolean bPressed, tBoolean bBorder);
void CtrlRedrawHandler(short sCol, short sRow, tBoolean bFocus,
                       tBoolean bPressed, tBoolean bBorder);
void AltRedrawHandler(short sCol, short sRow, tBoolean bFocus,
                      tBoolean bPressed, tBoolean bBorder);
void GUIRedrawHandler(short sCol, short sRow, tBoolean bFocus,
                      tBoolean bPressed, tBoolean bBorder);

//*****************************************************************************
//
// The bottom 2 rows of the virtual keyboard contains special keys which are
// handled differently from the basic, alphanumeric keys.
//
//*****************************************************************************
const tSpecialKey g_psRow4[] =
{
    {"Cap", 38, HID_KEYB_USAGE_CAPSLOCK, CapsLockHandler,
     CapsLockRedrawHandler},
    {"Shift", 54 , 0, ShiftLockHandler, ShiftLockRedrawHandler},
    {" ", 80, HID_KEYB_USAGE_SPACE, DefaultSpecialHandler, 0},
    {"Ent", 54, HID_KEYB_USAGE_ENTER, DefaultSpecialHandler, 0},
    {"BS", 38, HID_KEYB_USAGE_BACKSPACE, DefaultSpecialHandler, 0}
};

#define NUM_ROW4_KEYS (sizeof(g_psRow4) / sizeof(tSpecialKey))

//*****************************************************************************
//
// Keys on the fifth row of the virtual keyboard.  Strings are defined showing
// the keycaps in unshifted, shifted and caps states.  This row contains only
// cursor keys so the key caps are the same for each state.
//
//*****************************************************************************
const tSpecialKey g_psRow5[] =
{
    {"Alt", 54, 0, AltHandler, AltRedrawHandler},
    {"Ctrl", 54, 0, CtrlHandler, CtrlRedrawHandler},
    {"GUI", 36, 0, GUIHandler, GUIRedrawHandler},
    {"<", 26, HID_KEYB_USAGE_LEFT_ARROW, DefaultSpecialHandler, 0},
    {">", 26, HID_KEYB_USAGE_RIGHT_ARROW, DefaultSpecialHandler, 0},
    {"^", 26, HID_KEYB_USAGE_UP_ARROW, DefaultSpecialHandler, 0},
    {"v", 26, HID_KEYB_USAGE_DOWN_ARROW, DefaultSpecialHandler, 0},
};

