hrshygoodness/Luminary-Micro-Library/boards/dk-lm3s9b96/usb_dev_keyboard/usb_dev_keyboard.c
#define NUM_ROW5_KEYS (sizeof(g_psRow5) / sizeof(tSpecialKey))

//*****************************************************************************
//
// Define the rows of the virtual keyboard.
//
//*****************************************************************************
const tRow g_psKeyboard[NUM_KEYBOARD_ROWS] =
{
    {false, (void *)&g_sRow0, NUM_ROW0_KEYS, 20},
    {false, (void *)&g_sRow1, NUM_ROW1_KEYS, 20 + (KEYBOARD_CELL_WIDTH / 3)},
    {false, (void *)&g_sRow2, NUM_ROW2_KEYS, 20 +
     ((2 * KEYBOARD_CELL_WIDTH) / 3)},
    {false, (void *)&g_sRow3, NUM_ROW3_KEYS, 20},
    {true, (void *)g_psRow4, NUM_ROW4_KEYS, 20},
    {true, (void *)g_psRow5, NUM_ROW5_KEYS, 20 + (KEYBOARD_CELL_WIDTH / 4)}
};

//*****************************************************************************
//
// The current active key in the virtual keyboard.
//
//*****************************************************************************
short g_sFocusRow = 0;
short g_sFocusCol = 0;

//*****************************************************************************
//
// The coordinates of the last touchscreen press.
//
//*****************************************************************************
short g_sXPress = 0;
short g_sYPress = 0;

//*****************************************************************************
//
// Flags used to indicate events requiring attention from the main loop.
//
//*****************************************************************************
unsigned long g_ulCommand = 0;

//*****************************************************************************
//
// Values ORed into g_ulCommand to indicate screen press and release events.
//
//*****************************************************************************
#define COMMAND_PRESS       0x01
#define COMMAND_RELEASE     0x02

//*****************************************************************************
//
// SysCtlDelay takes 3 clock cycles so calculate the number of loops
// per millisecond.
//
// = ((50000000 cycles/sec) / (1000 ms/sec)) / 3 cycles/loop
//
// = (50000000 / (1000 * 3)) loops
//
//*****************************************************************************
#define SYSDELAY_1_MS (50000000 / (1000 * 3))

//*****************************************************************************
//
// This global indicates whether or not we are connected to a USB host.
//
//*****************************************************************************
volatile tBoolean g_bConnected = false;

//*****************************************************************************
//
// This global indicates whether or not the USB bus is currently in the suspend
// state.
//
//*****************************************************************************
volatile tBoolean g_bSuspended = false;

//*****************************************************************************
//
// Global system tick counter holds elapsed time since the application started
// expressed in 100ths of a second.
//
//*****************************************************************************
volatile unsigned long g_ulSysTickCount;

//*****************************************************************************
//
// The number of system ticks to wait for each USB packet to be sent before
// we assume the host has disconnected.  The value 50 equates to half a second.
//
//*****************************************************************************
#define MAX_SEND_DELAY          50

//*****************************************************************************
//
// This global is set to true if the host sends a request to set or clear
// any keyboard LED.
//
//*****************************************************************************
volatile tBoolean g_bDisplayUpdateRequired;

//*****************************************************************************
//
// This global holds the current state of the keyboard LEDs as sent by the
// host.
//
//*****************************************************************************
volatile unsigned char g_ucLEDStates;

//*****************************************************************************
//
// This global is set by the USB data handler if the host reports a change in
// the keyboard LED states.  The main loop uses it to update the virtual
// keyboard state.
//
//*****************************************************************************
volatile tBoolean g_bLEDStateChanged;

//*****************************************************************************
//
// This enumeration holds the various states that the keyboard can be in during
// normal operation.
//
//*****************************************************************************
volatile enum
{
    //
    // Unconfigured.
    //
    STATE_UNCONFIGURED,

    //
    // No keys to send and not waiting on data.
    //
    STATE_IDLE,

    //
    // Waiting on data to be sent out.
    //
    STATE_SENDING
} g_eKeyboardState = STATE_UNCONFIGURED;

//*****************************************************************************
//
// The current state of the modifier key flags which form the first byte of
// the report to the host.  This indicates the state of the shift, control,
// alt and GUI keys on the keyboard.
//
//*****************************************************************************
static unsigned char g_ucModifiers = 0;

//*****************************************************************************
//
// Graphics context used to show text on the color STN display.
//
//*****************************************************************************
tContext g_sContext;
//*****************************************************************************
//
// Debug-related definitions and declarations.
//
// Debug output is available via UART0 if DEBUG is defined during build.
//
//*****************************************************************************
#ifdef DEBUG
//*****************************************************************************
//
// Map all debug print calls to UARTprintf in debug builds.
//
//*****************************************************************************
#define DEBUG_PRINT UARTprintf


//*****************************************************************************
//
// The error routine that is called if the driver library encounters an error.
//
//*****************************************************************************
void
__error__(char *pcFilename, unsigned long ulLine)
{
    while(1)
    {
    }
}
#else

//*****************************************************************************
//
// Compile out all debug print calls in release builds.
//
//*****************************************************************************
#define DEBUG_PRINT while(0) ((int (*)(char *, ...))0)

#endif

//*****************************************************************************
//
// This function is called by the touchscreen driver whenever there is a
// change in press state or position.
//
//*****************************************************************************
static long
KeyboardTouchHandler(unsigned long ulMessage, long lX, long lY)
{
    switch(ulMessage)
    {
        //
        // The touchscreen has been pressed.  Remember the coordinates and
        // set the flag indicating that the main loop should process some new
        // input.
        //
        case WIDGET_MSG_PTR_DOWN:
            g_sXPress = (short)lX;
            g_sYPress = (short)lY;
            g_ulCommand |= COMMAND_PRESS;
            break;

        //
        // The touchscreen is no longer being pressed.  Release any key which
        // was previously pressed.
        //
        case WIDGET_MSG_PTR_UP:
            g_ulCommand |= COMMAND_RELEASE;
            break;

        //
        // We have nothing to do on pointer move events.
        //
        case WIDGET_MSG_PTR_MOVE:
            break;
    }

    return(0);
}

//*****************************************************************************
//
// Handles asynchronous events from the HID keyboard driver.
//
// \param pvCBData is the event callback pointer provided during
// USBDHIDKeyboardInit().  This is a pointer to our keyboard device structure
// (&g_sKeyboardDevice).
// \param ulEvent identifies the event we are being called back for.
// \param ulMsgData is an event-specific value.
// \param pvMsgData is an event-specific pointer.
//
// This function is called by the HID keyboard driver to inform the application
// of particular asynchronous events related to operation of the keyboard HID
// device.
//
// \return Returns 0 in all cases.
//
//*****************************************************************************
unsigned long KeyboardHandler(void *pvCBData, unsigned long ulEvent,
                              unsigned long ulMsgData, void *pvMsgData)
{
    switch (ulEvent)
    {
        //
        // The host has connected to us and configured the device.
        //
        case USB_EVENT_CONNECTED:
        {
            g_bConnected = true;
            g_bSuspended = false;
            break;
        }

        //
        // The host has disconnected from us.
        //
        case USB_EVENT_DISCONNECTED:
        {
            g_bConnected = false;
            break;
        }

        //
        // We receive this event every time the host acknowledges transmission
        // of a report. It is used here purely as a way of determining whether
        // the host is still talking to us or not.
        //
        case USB_EVENT_TX_COMPLETE:
        {
            //
            // Enter the idle state since we finished sending something.
            //
            g_eKeyboardState = STATE_IDLE;
            break;
        }

        //
        // This event indicates that the host has suspended the USB bus.
        //
        case USB_EVENT_SUSPEND:
        {
            g_bSuspended = true;
            break;
        }

        //
        // This event signals that the host has resumed signaling on the bus.
        //
        case USB_EVENT_RESUME:
        {
            g_bSuspended = false;
            break;
        }

        //
        // This event indicates that the host has sent us an Output or
        // Feature report and that the report is now in the buffer we provided
        // on the previous USBD_HID_EVENT_GET_REPORT_BUFFER callback.
        //
        case USBD_HID_KEYB_EVENT_SET_LEDS:
        {

            //
            // Remember the new LED state.
            //
            g_ucLEDStates = (unsigned char)(ulMsgData & 0xFF);

            //
            // Set a flag to tell the main loop that the LED state changed.
            //
            g_bLEDStateChanged = true;

            break;
        }

        //
        // We ignore all other events.
        //
        default:
        {
            break;
        }
    }
    return (0);
}

//***************************************************************************
//
// Wait for a period of time for the state to become idle.
//
// \param ulTimeoutTick is the number of system ticks to wait before
// declaring a timeout and returning \b false.
//
// This function polls the current keyboard state for ulTimeoutTicks system
// ticks waiting for it to become idle.  If the state becomes idle, the
// function returns true.  If it ulTimeoutTicks occur prior to the state
// becoming idle, false is returned to indicate a timeout.
//
// \return Returns \b true on success or \b false on timeout.
//
//***************************************************************************
tBoolean WaitForSendIdle(unsigned long ulTimeoutTicks)
{
    unsigned long ulStart;
    unsigned long ulNow;
    unsigned long ulElapsed;

    ulStart = g_ulSysTickCount;
    ulElapsed = 0;

    while (ulElapsed < ulTimeoutTicks)
    {
        //
        // Is the keyboard is idle, return immediately.
        //
        if (g_eKeyboardState == STATE_IDLE)
        {
            return (true);
        }

        //
        // Determine how much time has elapsed since we started waiting.  This
        // should be safe across a wrap of g_ulSysTickCount.  I suspect you
        // won't likely leave the app running for the 497.1 days it will take
        // for this to occur but you never know...
        //
        ulNow = g_ulSysTickCount;
        ulElapsed = (ulStart < ulNow) ? (ulNow - ulStart)
                        : (((unsigned long)0xFFFFFFFF - ulStart) + ulNow + 1);
    }

    //
    // If we get here, we timed out so return a bad return code to let the
    // caller know.
    //
    return (false);
}

//***************************************************************************
//
// Determine the X position on the screen for a given key in the virtual
// keyboard.
//
// \param sCol is the column number of the key whose position is being
//  queried.
// \param sRow is the row number of the key whose position is being queried.
//
// \return Returns the horizontal pixel coordinate of the left edge of the
// key. Note that this is 1 greater than you would expect since we allow
// space for the focus border round the character.
//
//***************************************************************************
short GetVirtualKeyX(short sCol, short sRow)
{
    short sX;
    short sCount;
    tSpecialKey *pKey;

    //
    // Is this a row of special keys?
    //
    if (g_psKeyboard[sRow].bSpecial)
    {
        //
        // Yes - we need to walk along the row of keys since the widths can
        // vary by key.
        //
        sX = g_psKeyboard[sRow].sLeftOffset;
        pKey = (tSpecialKey *)(g_psKeyboard[sRow].pvKeys);

        for (sCount = 0; sCount < sCol; sCount++)
        {
            sX += (pKey[sCount].sWidth + KEYBOARD_COL_SPACING);
        }

        //
        // Return the calculated X position for the key.
        //
        return (sX + 1);
    }
    else
    {
        //
        // This is a normal alphanumeric row so the keys are all the same
        // width.
        //
        return (g_psKeyboard[sRow].sLeftOffset +
                (sCol * KEYBOARD_CELL_WIDTH) + 1);
    }
}

//***************************************************************************
//
// Find a key on one row closest the a key on another row.
//
// \param sFromCol
// \param sFromRow
// \param sToRow
//
// This function is called during processing of the up and down keys while
// navigating the virtual keyboard.  It finds the key in row sToRow that sits
// closest to key index sFromCol in row sFromRow.
//
// \return Returns the index (column number) of the closest key in row sToRow.
//
//***************************************************************************
short VirtualKeyboardFindClosestKey(short sFromCol, short sFromRow, short sToRow)
{
    short sIndex;
    short sX;

    //
    // If moving between 2 alphanumeric rows, just move to the same key
    // index in the new row (taking care to pass back a valid key index).
    //
    if (!g_psKeyboard[sFromRow].bSpecial && !g_psKeyboard[sToRow].bSpecial)
    {
        sIndex = sFromCol;
        if (sIndex > g_psKeyboard[sToRow].sNumKeys)
        {
            sIndex = g_psKeyboard[sToRow].sNumKeys - 1;
        }

