hrshygoodness/Luminary-Micro-Library/boards/dk-lm3s9b96/usb_dev_keyboard/usb_dev_keyboard.c
        return (sIndex);
    }

    //
    // Determine the x position of the key we are moving from.
    //
    sX = GetVirtualKeyX(sFromCol, sFromRow);

    //
    // Check for cases where the supplied x coordinate is at or to the left of
    // any key in this row.  In this case, we always pass back index 0.
    //
    if (sX <= g_psKeyboard[sToRow].sLeftOffset)
    {
        return (0);
    }

    //
    // The x coordinate is not to the left of any key so we need to determine
    // which particular key it relates to.  The position is associated with a
    // key if it falls within the width of the key and the following space.
    //
    if (g_psKeyboard[sToRow].bSpecial)
    {
        //
        // This is a special key so the keys on this row can all have different
        // widths.  We walk through them looking for a hit.
        //
        for (sIndex = 1; sIndex < g_psKeyboard[sToRow].sNumKeys; sIndex++)
        {
            //
            // If the passed coordinate is less than the leftmost position of
            // this key, we've overshot.  Drop out since we've found our
            // answer.
            //
            if (sX < GetVirtualKeyX(sIndex, sToRow))
            {
                break;
            }
        }

        //
        // Return the index of the key one before the one we last looked at
        // since this is the key which contains the supplied x coordinate.
        // Since we end the loop above on the last key this handles cases
        // where the x coordinate passed is further right than any key on the
        // row.
        //
        return (sIndex - 1);
    }
    else
    {
        //
        // This is an alphanumeric row so we determine the index based on
        // the fixed character cell width.
        //
        sIndex = (sX - g_psKeyboard[sToRow].sLeftOffset) / KEYBOARD_CELL_WIDTH;

        //
        // If we calculated an index higher than the number of keys on the
        // row, return the largest index supported.
        //
        if (sIndex >= g_psKeyboard[sToRow].sNumKeys)
        {
            sIndex = g_psKeyboard[sToRow].sNumKeys - 1;
        }
    }

    //
    // Return the column index we calculated.
    //
    return (sIndex);
}

//***************************************************************************
//
// Draw a single key of the virtual keyboard.
//
// \param sCol contains the column number for the key to be drawn.
// \param sRow contains the row  number for the key to be drawn.
// \param bFocus is \b true if the red focus border is to be drawn around this
//  key or \b false if the border is to be erased.
// \param bPressed is \b true of the key is to be drawn in the pressed state
//  or \b false if it is to be drawn in the released state.
// \param bBorder is \b true if the whole key is to be redrawn or \b false
//  if only the key cap text is to be redrawn.
// \param bBright is \b true if the key is to be drawn in the bright (yellow)
//  color or \b false if drawn in the normal (grey) color.
//
// This function draws a single key, varying the look depending upon whether
// the key is pressed or released and whether it has the input focus or not.
// If the bBorder parameter is false, only the key label is refreshed.  If
// true, the whole key is redrawn.
//
// This is the lowest level function used to refresh the display of both
// alphanumeric and special keys.
//
// \return None.
//
//***************************************************************************
void DrawKey(short sCol, short sRow, tBoolean bFocus, tBoolean bPressed,
             tBoolean bBorder, tBoolean bBright)
{
    tRectangle sRectOutline;
    tRectangle sFocusBorder;
    tSpecialKey *psSpecial;
    tAlphaKeys *psAlpha;
    short sX;
    short sY;
    short sWidth;
    char pcBuffer[2];
    char *pcLabel;
    unsigned long ulHighlight;
    unsigned long ulShadow;

    //
    // Determine the position, width and text label for this key.
    //
    sX = GetVirtualKeyX(sCol, sRow);
    sY = KEYBOARD_TOP + (sRow * KEYBOARD_CELL_HEIGHT);
    if (g_psKeyboard[sRow].bSpecial)
    {
        psSpecial = (tSpecialKey *)g_psKeyboard[sRow].pvKeys;
        sWidth = psSpecial[sCol].sWidth;
        pcLabel = (char *)psSpecial[sCol].pcLabel;
    }
    else
    {
        sWidth = KEYBOARD_KEY_WIDTH;

        psAlpha = (tAlphaKeys *)g_psKeyboard[sRow].pvKeys;
        pcBuffer[1] = (char)0;
        pcBuffer[0] = (psAlpha->pcKey[g_eVirtualKeyState])[sCol];
        pcLabel = pcBuffer;
    }

    //
    // Determine the bounding rectangle for the key.  This rectangle is the
    // area containing the key background color and label text.  It excludes
    // the 1 line border.
    //
    sRectOutline.sXMin = sX + 1;
    sRectOutline.sYMin = sY + 1;
    sRectOutline.sXMax = (sX + sWidth) - 2;
    sRectOutline.sYMax = (sY + KEYBOARD_KEY_HEIGHT) - 2;

    //
    // If the key has focus, we will draw a 1 pixel red line around it
    // outside the actual key cell.  Set up the rectangle for this here.
    //
    sFocusBorder.sXMin = sX - 1;
    sFocusBorder.sYMin = sY - 1;
    sFocusBorder.sXMax = sX + sWidth;
    sFocusBorder.sYMax = sY + KEYBOARD_KEY_HEIGHT;

    //
    // Pick the relevant highlight and shadow colors depending upon the button
    // state.
    //
    if (!bBright)
    {
        //
        // The key is not bright so just pick the normal (grey)
        //
        ulHighlight = bPressed ? SHADOW_COLOR : HIGHLIGHT_COLOR;
        ulShadow = bPressed ? HIGHLIGHT_COLOR : SHADOW_COLOR;
    }
    else
    {
        ulHighlight = bPressed ? SHADOW_BRIGHT_COLOR : HIGHLIGHT_BRIGHT_COLOR;
        ulShadow = bPressed ? HIGHLIGHT_BRIGHT_COLOR : SHADOW_BRIGHT_COLOR;
    }

    //
    // Are we drawing the whole key or merely updating the label?
    //
    if (bBorder)
    {
        //
        // Draw the focus border in the relevant color.
        //
        GrContextForegroundSet(&g_sContext, bFocus ? FOCUS_COLOR
                        : BACKGROUND_COLOR);
        GrRectDraw(&g_sContext, &sFocusBorder);

        //
        // Draw the key border.
        //
        GrContextForegroundSet(&g_sContext, ulHighlight);
        GrLineDrawH(&g_sContext, sX, sX + sWidth - 1, sY);
        GrLineDrawV(&g_sContext, sX, sY, sY + KEYBOARD_KEY_HEIGHT - 1);
        GrContextForegroundSet(&g_sContext, ulShadow);
        GrLineDrawH(&g_sContext, sX + 1, sX + sWidth - 1, sY
                        + KEYBOARD_KEY_HEIGHT - 1);
        GrLineDrawV(&g_sContext, sX + sWidth - 1, sY + 1, sY
                        + KEYBOARD_KEY_HEIGHT - 1);
    }

    //
    // Fill the button with the main button color
    //
    GrContextForegroundSet(&g_sContext, bBright ? KEY_BRIGHT_COLOR : KEY_COLOR);
    GrRectFill(&g_sContext, &sRectOutline);

    //
    // Update the key label.  We center the text in the key, moving it one
    // pixel down and to the right if the key is in the pressed state.
    //
    GrContextForegroundSet(&g_sContext, KEY_TEXT_COLOR);
    GrContextBackgroundSet(&g_sContext, bBright ? KEY_BRIGHT_COLOR : KEY_COLOR);
    GrContextClipRegionSet(&g_sContext, &sRectOutline);
    GrStringDrawCentered(&g_sContext, pcLabel, -1, (bPressed ? 1 : 0)
                    + ((sRectOutline.sXMax + sRectOutline.sXMin) / 2),
                          (bPressed ? 1 : 0) + ((sRectOutline.sYMax
                                         + sRectOutline.sYMin) / 2), true);

    //
    // Revert to the previous clipping region.
    //
    sRectOutline.sXMin = 0;
    sRectOutline.sYMin = 0;
    sRectOutline.sXMax = GrContextDpyWidthGet(&g_sContext) - 1;
    sRectOutline.sYMax = GrContextDpyHeightGet(&g_sContext) - 1;
    GrContextClipRegionSet(&g_sContext, &sRectOutline);

    //
    // Revert to the usual background and foreground colors.
    //
    GrContextBackgroundSet(&g_sContext, BACKGROUND_COLOR);
    GrContextForegroundSet(&g_sContext, ClrWhite);
}

//***************************************************************************
//
// Call the appropriate handler to draw a single key on the virtual
// keyboard. This top level function handles both alphanumeric and special
// keys.
//
// \param sCol contains the column number for the key to be drawn.
// \param sRow contains the row  number for the key to be drawn.
// \param bFocus is \b true if the red focus border is to be drawn around this
//  key or \b false if the border is to be erased.
// \param bPressed is \b true of the key is to be drawn in the pressed state
//  or \b false if it is to be drawn in the released state.
// \param bBorder is \b true if the whole key is to be redrawn or \b false
//  if only the key cap text is to be redrawn.
//
// This function draws a single key on the keyboard, varying the look depending
// upon whether the key is pressed or released and whether it has the input
// focus or not.  If the bBorder parameter is \b false, only the key label is
// refreshed.  If \b true, the whole key is redrawn.
//
// If the specific key is a special key with a redraw handler set, the
// handler function is called to update the display.  If not, the basic
// DrawKey() function is used.
//
// \return None.
//
//***************************************************************************
void DrawVirtualKey(short sCol, short sRow, tBoolean bFocus, tBoolean bPressed,
                    tBoolean bBorder)
{
    tSpecialKey *psSpecial;

    //
    // Get a pointer to the array of special keys for this row (even though
    // we are not yet sure if this is a special row).
    //
    psSpecial = (tSpecialKey *)g_psKeyboard[sRow].pvKeys;

    //
    // Is this a special row and, if so, does the current key have a redraw
    // handler installed?
    //
    if (g_psKeyboard[sRow].bSpecial && psSpecial[sCol].pfnRedrawHandler)
    {
        //
        // Yes - call the special handler for this key.
        //
        psSpecial[sCol].pfnRedrawHandler(sCol, sRow, bFocus, bPressed, bBorder);
    }
    else
    {
        //
        // The key has no redraw handler so just treat it as a normal
        // key.
        //
        DrawKey(sCol, sRow, bFocus, bPressed, bBorder, false);
    }
}

//***************************************************************************
//
// Draw or update the virtual keyboard on the display.
//
// \param bBorder is \b true if the whole virtual keyboard is to be drawn or
// \b false if only the key caps have to be updated.
//
// Draw the virtual keyboard on the display.  The bBorder parameter controls
// whether the whole keyboard is drawn (true) or whether only the key labels
// are replaced (false).
//
// \return None.
//
//***************************************************************************
void DrawVirtualKeyboard(tBoolean bBorder)
{
    short sCol;
    short sRow;

    //
    // Select the font we use for the keycaps.
    //
    GrContextFontSet(&g_sContext, &g_sFontFixed6x8);

    //
    // Loop through each row, drawing each to the display
    //
    for (sRow = 0; sRow < NUM_KEYBOARD_ROWS; sRow++)
    {
        //
        // Loop through each key on this row of the keyboard.
        //
        for (sCol = 0; sCol < g_psKeyboard[sRow].sNumKeys; sCol++)
        {
            //
            // Draw a single key.
            //
            DrawVirtualKey(sCol, sRow, false, false, bBorder);
        }
    }
}

//****************************************************************************
//
// This function is called by the main loop if it receives a signal from the
// USB data handler telling it that the host has changed the state of the
// keyboard LEDs.  We update the state and display accordingly.
//
//****************************************************************************
void KeyboardLEDsChanged(void)
{
    tBoolean bCapsOn;

    //
    // Clear the flag indicating a state change occurred.
    //
    g_bLEDStateChanged = false;

    //
    // Is CAPSLOCK on or off?
    //
    bCapsOn = (g_ucLEDStates & HID_KEYB_CAPS_LOCK) ? true : false;

    //
    // Update the state to ensure that the communicated CAPSLOCK state is
    // incorporated.
    //
    switch (g_eVirtualKeyState)
    {
        //
        // Are we in an unshifted state?
        //
        case KEY_STATE_NORMAL:
        case KEY_STATE_CAPS:
        {
            if (bCapsOn)
            {
                g_eVirtualKeyState = KEY_STATE_CAPS;
            }
            else
            {
                g_eVirtualKeyState = KEY_STATE_NORMAL;
            }
            break;
        }

            //
            // Are we in a shifted state?
            //
        case KEY_STATE_SHIFT:
        case KEY_STATE_BOTH:
        {
            if (bCapsOn)
            {
                g_eVirtualKeyState = KEY_STATE_BOTH;
            }
            else
            {
                g_eVirtualKeyState = KEY_STATE_SHIFT;
            }
            break;
        }

        default:
        {
            //
            // Do nothing.  This default case merely prevents a compiler
            // warning related to the NUM_KEY_STATES enum member not having
            // a handler.
            //
            break;
        }
    }

    //
    // Redraw the virtual keyboard keycaps with the appropriate characters.
    //
    DrawVirtualKeyboard(false);

    //
    // Set the CAPSLOCK LED appropriately.
    //
    GPIOPinWrite(CAPSLOCK_GPIO_BASE, CAPSLOCK_GPIO_PIN,
    bCapsOn ? CAPSLOCK_ACTIVE : CAPSLOCK_INACTIVE);
}

//***************************************************************************
//
// Special key handler for the Caps virtual key.
//
// \param sCol is the column number of the key which has been pressed.
// \param sRow is the row number of the key which has been pressed.
// \param bPress is \b true if the key has been pressed or \b false if it has
// been released.
//
// This function is called whenever the user presses the "Select" button
// when the CapsLock key on the virtual keyboard has input focus.
//
// \returns Returns \b KEYB_SUCCESS on success or a non-zero value to
// indicate failure.
//
//***************************************************************************
unsigned long
CapsLockHandler(short sCol, short sRow, tBoolean bPress)
{
    unsigned long ulRetcode;

    //
    // Note that we don't set the state or redraw the keyboard here since the
    // host is expected to send us an update telling is that the CAPSLOCK
    // state changed.  We trigger the keyboard redrawing and LED setting off
    // this message instead.  In this function, we only redraw the CAPSLOCK
    // key itself to provide user feedback.
    //
    DrawKey(sCol, sRow, bPress ? true : false, bPress, true,
            (g_ucLEDStates & HID_KEYB_CAPS_LOCK) ? true : false);

    //
    // Send the CAPSLOCK key code back to the host.
    //
    g_eKeyboardState = STATE_SENDING;
    ulRetcode = USBDHIDKeyboardKeyStateChange((void *)&g_sKeyboardDevice,
                                              g_ucModifiers,
                                              HID_KEYB_USAGE_CAPSLOCK, bPress);

    return (ulRetcode);
}

//***************************************************************************
//
// Special key handler for the Ctrl virtual key.
//
// \param sCol is the column number of the key which has been pressed.
// \param sRow is the row number of the key which has been pressed.
// \param bPress is \b true if the key has been pressed or \b false if it has
// been released.
//
// This function is called whenever the user presses the "Select" button
// when the Ctrl key on the virtual keyboard has input focus.
//
// \returns Returns \b KEYB_SUCCESS on success or a non-zero value to
// indicate failure.
//
//***************************************************************************
unsigned long
CtrlHandler(short sCol, short sRow, tBoolean bPress)
{
    unsigned long ulRetcode;

    //
    // Ignore key release messages.
    //
    if(bPress)
    {
        //
        // Toggle the modifier bit for the left control key.
        //
        g_ucModifiers ^= HID_KEYB_LEFT_CTRL;

        //
        // Update the host with the new modifier state.  Sending usage code
        // HID_KEYB_USAGE_RESERVED indicates no key press so this changes only
        // the modifiers.
        //
        g_eKeyboardState = STATE_SENDING;
        ulRetcode = USBDHIDKeyboardKeyStateChange((void *)&g_sKeyboardDevice,
                                                  g_ucModifiers,
                                                  HID_KEYB_USAGE_RESERVED,
                                                  true);
    }
    else
    {
        //
        // We are ignoring key release but tell the caller that all is well.
        //
        ulRetcode = KEYB_SUCCESS;
    }

    //
    // Redraw the key in the appropriate state.
    //
    DrawKey(sCol, sRow, bPress ? true : false, bPress, true,
            (g_ucModifiers & HID_KEYB_LEFT_CTRL) ? true : false);

    return(ulRetcode);
}

//***************************************************************************
//
// Special key handler for the Alt virtual key.
//
// \param sCol is the column number of the key which has been pressed.
// \param sRow is the row number of the key which has been pressed.
// \param bPress is \b true if the key has been pressed or \b false if it has
// been released.
//
// This function is called whenever the user presses the "Select" button
// when the Alt key on the virtual keyboard has input focus.
//
// \returns Returns \b KEYB_SUCCESS on success or a non-zero value to
// indicate failure.
//
//***************************************************************************
unsigned long
AltHandler(short sCol, short sRow, tBoolean bPress)
{
    unsigned long ulRetcode;

    //
    // Ignore key release messages.
    //
    if(bPress)
    {
        //
        // Toggle the modifier bit for the left ALT key.
        //
        g_ucModifiers ^= HID_KEYB_LEFT_ALT;

        //
        // Update the host with the new modifier state.  Sending usage code
        // HID_KEYB_USAGE_RESERVED indicates no key press so this changes only
        // the modifiers.
        //
        g_eKeyboardState = STATE_SENDING;
        ulRetcode = USBDHIDKeyboardKeyStateChange((void *)&g_sKeyboardDevice,
                                                  g_ucModifiers,
                                                  HID_KEYB_USAGE_RESERVED,
                                                  true);
    }
    else
    {
        //
        // We are ignoring key release but tell the caller that all is well.
        //
        ulRetcode = KEYB_SUCCESS;
    }

    //
    // Redraw the key in the appropriate state.
    //
    DrawKey(sCol, sRow, bPress ? true : false, bPress, true,
            (g_ucModifiers & HID_KEYB_LEFT_ALT) ? true : false);

    return(ulRetcode);
}

//***************************************************************************
//
// Special key handler for the GUI virtual key.
//
// \param sCol is the column number of the key which has been pressed.
// \param sRow is the row number of the key which has been pressed.
// \param bPress is \b true if the key has been pressed or \b false if it has
// been released.
//
// This function is called whenever the user presses the "Select" button
// when the GUI key on the virtual keyboard has input focus.
//
// \returns Returns \b KEYB_SUCCESS on success or a non-zero value to
// indicate failure.
//
//***************************************************************************
unsigned long
GUIHandler(short sCol, short sRow, tBoolean bPress)
{
    unsigned long ulRetcode;

    //
    // Ignore key release messages.
    //
    if(bPress)
    {
        //
        // Toggle the modifier bit for the left GUI key.
        //
        g_ucModifiers ^= HID_KEYB_LEFT_GUI;

        //
        // Update the host with the new modifier state.  Sending usage code
        // HID_KEYB_USAGE_RESERVED indicates no key press so this changes only
        // the modifiers.
        //
        g_eKeyboardState = STATE_SENDING;
        ulRetcode = USBDHIDKeyboardKeyStateChange((void *)&g_sKeyboardDevice,
                                                  g_ucModifiers,
                                                  HID_KEYB_USAGE_RESERVED,
                                                  true);
    }
    else
    {
        //
        // We are ignoring key release but tell the caller that all is well.
        //
        ulRetcode = KEYB_SUCCESS;
    }

    //
    // Redraw the key in the appropriate state.
    //
    DrawKey(sCol, sRow, bPress ? true : false, bPress, true,
            (g_ucModifiers & HID_KEYB_LEFT_GUI) ? true : false);

    return(ulRetcode);
}

//***************************************************************************
//
// Special key handler for the Shift virtual key.
//
// \param sCol is the column number of the key which has been pressed.
// \param sRow is the row number of the key which has been pressed.
// \param bPress is \b true if the key has been pressed or \b false if it has
// been released.
//
// This function is called whenever the user presses the "Select" button
// when the ShiftLock key on the virtual keyboard has input focus.
//
// \returns Returns \b true on success or \b false on failure.
//
//***************************************************************************
unsigned long
ShiftLockHandler(short sCol, short sRow, tBoolean bPress)
{
    //
    // We ignore key release for the shift lock.
    //
    if(bPress)
    {
        //
        // Set the new state by toggling the shift component.
        //
        switch(g_eVirtualKeyState)
        {
            case KEY_STATE_NORMAL:
            {
                g_eVirtualKeyState = KEY_STATE_SHIFT;
                g_ucModifiers |= HID_KEYB_LEFT_SHIFT;
                break;
            }

            case KEY_STATE_SHIFT:
            {
                g_eVirtualKeyState = KEY_STATE_NORMAL;
                g_ucModifiers &= ~HID_KEYB_LEFT_SHIFT;
                break;
            }

            case KEY_STATE_CAPS:
            {
                g_eVirtualKeyState = KEY_STATE_BOTH;
                g_ucModifiers |= HID_KEYB_LEFT_SHIFT;
                break;
            }

            case KEY_STATE_BOTH:
            {
                g_eVirtualKeyState = KEY_STATE_CAPS;
                g_ucModifiers &= ~HID_KEYB_LEFT_SHIFT;
                break;
            }

            default:
            {
                //
                // Do nothing.  This default case merely prevents a compiler
                // warning related to the NUM_KEY_STATES enum member not having
                // a handler.
                //
                break;
            }
        }

        //
        // Redraw the keycaps to show the shifted characters.
        //
        DrawVirtualKeyboard(false);
    }

    //
    // Redraw the SHIFT key in the appropriate state.
    //
    DrawKey(sCol, sRow, bPress ? true : false, bPress, true,
            (g_ucModifiers & HID_KEYB_LEFT_SHIFT) ? true : false);

    return(KEYB_SUCCESS);
}

//***************************************************************************
//
// Redraw the caps lock key. This is a thin layer over the usual DrawKey
// function which merely sets the key into bright or normal mode depending
// upon the current caps lock state.
//
//***************************************************************************
void
CapsLockRedrawHandler(short sCol, short sRow, tBoolean bFocus,
                tBoolean bPressed, tBoolean bBorder)
{
    //
    // Draw the key in either normal color if the CAPS lock is not active
    // or in the bright color if it is.
    //
    DrawKey(sCol, sRow, bFocus, bPressed, bBorder,
            ((g_eVirtualKeyState == KEY_STATE_BOTH) ||
             (g_eVirtualKeyState == KEY_STATE_CAPS)) ? true : false);
}

