hrshygoodness/Luminary-Micro-Library/boards/dk-lm3s9b96/usb_dev_keyboard/usb_dev_keyboard.c
//***************************************************************************
//
// Redraw the Shift lock key. This is a thin layer over the usual DrawKey
// function which merely sets the key into bright or normal mode depending
// upon the current shift state.
//
//***************************************************************************
void
ShiftLockRedrawHandler(short sCol, short sRow, tBoolean bFocus,
                tBoolean bPressed, tBoolean bBorder)
{
    //
    // Draw the key in either normal color if the shift lock is not active
    // or in the bright color if it is.
    //
    DrawKey(sCol, sRow, bFocus, bPressed, bBorder,
            (g_ucModifiers & HID_KEYB_LEFT_SHIFT) ? true : false);
}

//***************************************************************************
//
// Redraw the Ctrl sticky key. This is a thin layer over the usual DrawKey
// function which merely sets the key into bright or normal mode depending
// upon the current key state.
//
//***************************************************************************
void
CtrlRedrawHandler(short sCol, short sRow, tBoolean bFocus,
                  tBoolean bPressed, tBoolean bBorder)
{
    //
    // Draw the key in either normal color if CTRL is not active
    // or in the bright color if it is.
    //
    DrawKey(sCol, sRow, bFocus, bPressed, bBorder,
            (g_ucModifiers & HID_KEYB_LEFT_CTRL) ? true : false);
}

//***************************************************************************
//
// Redraw the Alt sticky key. This is a thin layer over the usual DrawKey
// function which merely sets the key into bright or normal mode depending
// upon the current key state.
//
//***************************************************************************
void
AltRedrawHandler(short sCol, short sRow, tBoolean bFocus,
                 tBoolean bPressed, tBoolean bBorder)
{
    //
    // Draw the key in either normal color if CTRL is not active
    // or in the bright color if it is.
    //
    DrawKey(sCol, sRow, bFocus, bPressed, bBorder,
            (g_ucModifiers & HID_KEYB_LEFT_ALT) ? true : false);
}

//***************************************************************************
//
// Redraw the GUI sticky key. This is a thin layer over the usual DrawKey
// function which merely sets the key into bright or normal mode depending
// upon the current key state.
//
//***************************************************************************
void
GUIRedrawHandler(short sCol, short sRow, tBoolean bFocus,
                  tBoolean bPressed, tBoolean bBorder)
{
    //
    // Draw the key in either normal color if CTRL is not active
    // or in the bright color if it is.
    //
    DrawKey(sCol, sRow, bFocus, bPressed, bBorder,
           (g_ucModifiers & HID_KEYB_LEFT_GUI) ? true : false);
}

//***************************************************************************
//
// Special key handler for the space, enter, backspace and cursor control
// virtual keys.
//
// \param sCol is the column number of the key which has been pressed.
// \param sRow is the row number of the key which has been pressed.
// \param bPress is \b true if the key has been pressed or \b false if it has
// been released.
//
// This function is called whenever the user presses the "Select" button
// when the space, backspace, enter or cursor control keys on the virtual
// keyboard have input focus.  These keys are like any other alpha key in that
// they merely send a single usage code back to the host.  We need a special
// handler for them, however, since they are on the bottom row of the virtual
// keyboard and this row contains other special keys.
//
// \returns Returns \b true on success or \b false on failure.
//
//***************************************************************************
unsigned long
DefaultSpecialHandler(short sCol, short sRow, tBoolean bPress)
{
    tSpecialKey *psKey;
    unsigned long ulRetcode;

    //
    // Get a pointer to the array of keys for this row.
    //
    psKey = (tSpecialKey *)g_psKeyboard[sRow].pvKeys;

    //
    // Send the usage code for this key back to the USB host.
    //
    g_eKeyboardState = STATE_SENDING;
    ulRetcode = USBDHIDKeyboardKeyStateChange((void *)&g_sKeyboardDevice,
                                g_ucModifiers, psKey[sCol].cUsageCode, bPress);

    //
    // Redraw the key in the appropriate state.
    //
    DrawKey(sCol, sRow, bPress ? true : false, bPress, true, false);

    return(ulRetcode);
}

//*****************************************************************************
//
// Processes a single key press on the virtual keyboard.
//
// \param sCol is the column number of the key which has been pressed.
// \param sRow is the row number of the key which has been pressed.
// \param bPress is \b true if the key has been pressed or \b false if it has
// been released.
//
// This function is called whenever the "Select" button is pressed or released.
// Depending upon the specific key, this will either call a special key handler
// function or send a report back to the USB host indicating the change of
// state.
//
// \return Returns \b true on success or \b false on failure.
//
//*****************************************************************************
tBoolean
VirtualKeyboardKeyPress(short sCol, short sRow, tBoolean bPress)
{
    tSpecialKey *psKey;
    tAlphaKeys *psAlphaKeys;
    unsigned long ulRetcode;
    tBoolean bSuccess;

    //
    // Are we dealing with a special key?
    //
    if(g_psKeyboard[sRow].bSpecial)
    {
        //
        // Yes - call the handler for this special key.
        //
        psKey = (tSpecialKey *)g_psKeyboard[sRow].pvKeys;
        ulRetcode = psKey[sCol].pfnPressHandler(sCol, sRow, bPress);

        DEBUG_PRINT("Key \"%s\" %s\n", psKey[sCol].pcLabel,
                    (bPress ? "pressed" : "released"));
    }
    else
    {
        //
        // Normal key - add or remove this key from the list of keys currently
        // pressed and pass the latest report back to the host.
        //
        psAlphaKeys = (tAlphaKeys *)g_psKeyboard[sRow].pvKeys;
        g_eKeyboardState = STATE_SENDING;
        ulRetcode = USBDHIDKeyboardKeyStateChange(
                                             (void *)&g_sKeyboardDevice,
                                             g_ucModifiers,
                                             psAlphaKeys->pcUsageCodes[sCol],
                                             bPress);
        DEBUG_PRINT("Key \"%c\" %s\n",
                    psAlphaKeys->pcKey[g_eVirtualKeyState][sCol],
                    (bPress ? "pressed" : "released"));

        //
        // Redraw the key in the appropriate state.
        //
        DrawKey(sCol, sRow, bPress ? true : false, bPress, true, false);
    }

    //
    // Did we schedule the report for transmission?
    //
    if(ulRetcode == KEYB_SUCCESS)
    {
        //
        // Wait for the host to acknowledge the transmission if all went well.
        //
        bSuccess = WaitForSendIdle(MAX_SEND_DELAY);

        //
        // Did we time out waiting for the packet to be sent?
        //
        if (!bSuccess)
        {
            //
            // Yes - assume the host disconnected and go back to
            // waiting for a new connection.
            //
            g_bConnected = 0;
        }
    }
    else
    {
        //
        // An error was reported when trying to send the character.
        //
        bSuccess = false;
    }
    return(bSuccess);
}

//*****************************************************************************
//
// Map a screen coordinate to the column and row of a virtual key.
//
// \param sX is the screen X coordinate that is to be mapped.
// \param sY is the screen Y coordinate that is to be mapped.
// \param pusCol is a pointer to the variable which will be written with the
// column number of the virtual key at screen position (sX, sY).
// \param pusRow is a pointer to the variable which will be written with the
// row number of the virtual key at screen position (sX, sY).
//
// \return Returns \b true if a virtual key exists at the position provided or
// \b false otherwise.  If \b false is returned, pointers \e pusCol and \e
// pusRow will not be written.
//
//*****************************************************************************
static tBoolean
FindVirtualKey(short sX, short sY, short *psCol, short *psRow)
{
    unsigned long ulRow, ulCol, ulNumKeys;
    short sKeyX, sKeyWidth;
    tSpecialKey *pKey;

    //
    // Initialize the column value.
    //
    ulCol = 0;

    //
    // Determine which row the coordinates occur in.
    //
    for(ulRow = 0; ulRow < NUM_KEYBOARD_ROWS; ulRow++)
    {
        if((sY > (KEYBOARD_TOP + (ulRow * KEYBOARD_CELL_HEIGHT))) &&
           (sY < (KEYBOARD_TOP + (ulRow * KEYBOARD_CELL_HEIGHT) +
            KEYBOARD_KEY_HEIGHT)))
        {
            //
            // If this is a standard alphanumeric row, we can determine the
            // mapping arithmetically since all the keys are the same width.
            if(!g_psKeyboard[ulRow].bSpecial)
            {
                //
                // First check to make sure that the press is not to the left
                // of the first key in the row.
                //
                if(sX < g_psKeyboard[ulRow].sLeftOffset)
                {
                    return(false);
                }

                //
                // This includes presses that occur in the space between
                // keys but, given that the touchscreen is not hugely accurate
                // and that fingers or styli will likely cover more than a
                // couple of pixels, this is probably perfectly fine.
                //
                ulCol = ((sX - g_psKeyboard[ulRow].sLeftOffset) /
                         KEYBOARD_CELL_WIDTH);

                //
                // If we calculated an out of range column, this means no key
                // exists under the press position so return false to indicate
                // this.
                //
                if(ulCol >= g_psKeyboard[ulRow].sNumKeys)
                {
                    return(false);
                }
            }
            else
            {
                //
                // The touch is somewhere within this row of keys.  How many keys
                // are in this row?
                //
                ulNumKeys = g_psKeyboard[ulRow].sNumKeys;
                sKeyX = g_psKeyboard[ulRow].sLeftOffset;

                //
                // Walk through the keys in this row.
                //
                for(ulCol = 0; ulCol < ulNumKeys; ulCol++)
                {
                    sKeyX = GetVirtualKeyX(ulCol, ulRow);
                    pKey = (tSpecialKey *)(g_psKeyboard[ulRow].pvKeys);
                    sKeyWidth = pKey[ulCol].sWidth + KEYBOARD_COL_SPACING;

                    if((sX >= sKeyX) && (sX < (sKeyX + sKeyWidth)))
                    {
                        //
                        // We found a matching key so drop out of the loop.
                        //
                        break;
                    }
                }

                //
                // If we get here and ulCol has reached ulNumKeys, we didn't
                // find a key under the press position.
                //
                if(ulCol == ulNumKeys)
                {
                    return(false);
                }
            }
            break;
        }
    }

    //
    // If we end up here and the row number is equal to the number of rows in
    // the keyboard, the press was not in any keyboard row so return false.
    //
    if(ulRow == NUM_KEYBOARD_ROWS)
    {
        return(false);
    }

    //
    // At this point, we found a key beneath the press so we return the
    // information to the caller.
    //
    *psCol = (short)ulCol;
    *psRow = (short)ulRow;
    return(true);
}

//*****************************************************************************
//
// This is the main loop that runs the application.
//
//*****************************************************************************
int
main(void)
{
    tRectangle sRect;
    long lCenterX;
    unsigned long ulLastTickCount, ulProcessing;
    tBoolean bRetcode, bLastSuspend, bKeyPressed;

    //
    // Set the clocking to run directly from the crystal.
    //
    SysCtlClockSet(SYSCTL_SYSDIV_4 | SYSCTL_USE_PLL | SYSCTL_OSC_MAIN |
                    SYSCTL_XTAL_16MHZ);

    //
    // Set the device pinout appropriately for this board.
    //
    PinoutSet();

    //
    // Configure GPIO pin which controls the CAPSLOCK LED and turn it off
    // initially.  Note that PinoutSet() already enabled the GPIO peripheral
    // containing this pin
    //
    GPIOPinTypeGPIOOutput(CAPSLOCK_GPIO_BASE, CAPSLOCK_GPIO_PIN);
    GPIOPinWrite(CAPSLOCK_GPIO_BASE, CAPSLOCK_GPIO_PIN, CAPSLOCK_INACTIVE);

#ifdef DEBUG
    //
    // Configure the relevant pins such that UART0 owns them.
    //
    GPIOPinTypeUART(GPIO_PORTA_BASE, GPIO_PIN_0 | GPIO_PIN_1);

    //
    // Open UART0 for debug output.
    //
    UARTStdioInit(0);
#endif

    //
    // Not configured initially.
    //
    g_bConnected = false;
    g_bSuspended = false;
    bLastSuspend = false;

    //
    // Initialize the display driver.
    //
    Kitronix320x240x16_SSD2119Init();

    //
    // Initialize the graphics context.
    //
    GrContextInit(&g_sContext, &g_sKitronix320x240x16_SSD2119);

    //
    // Fill the top 15 rows of the screen with blue to create the banner.
    //
    sRect.sXMin = 0;
    sRect.sYMin = 0;
    sRect.sXMax = GrContextDpyWidthGet(&g_sContext) - 1;
    sRect.sYMax = 23;
    GrContextForegroundSet(&g_sContext, ClrDarkBlue);
    GrRectFill(&g_sContext, &sRect);

    //
    // Put a white box around the banner.
    //
    GrContextForegroundSet(&g_sContext, ClrWhite);
    GrRectDraw(&g_sContext, &sRect);

    //
    // Put the application name in the middle of the banner.
    //
    lCenterX = GrContextDpyWidthGet(&g_sContext) / 2;
    GrContextFontSet(&g_sContext, &g_sFontCm20);
    GrStringDrawCentered(&g_sContext, "usb-dev-keyboard", -1,
                    lCenterX, 10, 0);

    //
    // Enable the peripherals used by this example.
    //
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOA);

    //
    // Pass our device information to the USB HID device class driver,
    // initialize the USB
    // controller and connect the device to the bus.
    //
    USBDHIDKeyboardInit(0, &g_sKeyboardDevice);

    //
    // Set the system tick to fire 100 times per second.
    //
    SysTickPeriodSet(SysCtlClockGet() / SYSTICKS_PER_SECOND);
    SysTickIntEnable();
    SysTickEnable();

    //
    // Initialize the touch screen driver.
    //
    TouchScreenInit();

    //
    // Set the touch screen event handler.
    //
    TouchScreenCallbackSet(KeyboardTouchHandler);

    //
    // The main loop starts here.  We begin by waiting for a host connection
    // then drop into the main keyboard handling section.  If the host
    // disconnects, we return to the top and wait for a new connection.
    //
    while(1)
    {
        //
        // Fill all but the top 24 rows of the screen with black to erase the
        // keyboard.
        //
        sRect.sXMin = 0;
        sRect.sYMin = 24;
        sRect.sXMax = GrContextDpyWidthGet(&g_sContext) - 1;
        sRect.sYMax = GrContextDpyHeightGet(&g_sContext) - 1;
        GrContextForegroundSet(&g_sContext, ClrBlack);
        GrRectFill(&g_sContext, &sRect);

        //
        // Tell the user what we are doing and provide some basic instructions.
        //
        GrContextFontSet(&g_sContext, &g_sFontCmss22b);
        GrContextForegroundSet(&g_sContext, ClrWhite);
        GrStringDrawCentered(&g_sContext, " Waiting for host... ", -1,
                        lCenterX, 40, true);
        GrContextFontSet(&g_sContext, &g_sFontFixed6x8);
        DEBUG_PRINT("Waiting for host connection...\n");

        //
        // Wait for USB configuration to complete. Even in this state, we look
        // for key presses and, if any occur while the bus is suspended, we
        // issue a remote wakeup request.
        //
        while(!g_bConnected)
        {
            //
            // Remember the current time.
            //
            ulLastTickCount = g_ulSysTickCount;

            //
            // Has the suspend state changed since last time we checked?
            //
            if(bLastSuspend != g_bSuspended)
            {
                //
                // Yes - the state changed so update the display.
                //
                bLastSuspend = g_bSuspended;
                GrContextFontSet(&g_sContext, &g_sFontCmss22b);
                GrStringDrawCentered(&g_sContext,
                                     (bLastSuspend ? "   Bus suspended...   ":
                                                     " Waiting for host... "),
                                     -1, lCenterX, 40, true);
                DEBUG_PRINT(bLastSuspend ? "Bus suspended.\n" :
                            "Bus resumed.\n");

