hrshygoodness/Luminary-Micro-Library/boards/dk-lm3s9b96/usb_dev_keyboard/usb_dev_keyboard.c
            }

            //
            // Wait for at least 1 system tick to have gone by before we poll
            // the buttons again.
            //
            while(g_ulSysTickCount == ulLastTickCount)
            {
                //
                // Hang around doing nothing.
                //
            }
        }

        //
        // Update the status.
        //
        GrContextFontSet(&g_sContext, &g_sFontCmss22b);
        GrStringDrawCentered(&g_sContext, " Host connected... ", -1,
                        lCenterX, 40, true);
        DEBUG_PRINT("Host connected.\n");

        //
        // Enter the idle state.
        //
        g_eKeyboardState = STATE_IDLE;

        //
        // Draw the keyboard on the display.
        //
        DrawVirtualKeyboard(true);

        //
        // Assume that the bus is not currently suspended if we have just been
        // configured.
        //
        bLastSuspend = false;

        //
        // Start with the assumption that no keys are pressed.
        //
        bKeyPressed = false;

        //
        // Keep transfering characters from the UART to the USB host for as
        // long as we are connected to the host.
        //
        while(g_bConnected)
        {
            //
            // Remember the current time.
            //
            ulLastTickCount = g_ulSysTickCount;

            //
            // Has the suspend state changed since last time we checked?
            //
            if(bLastSuspend != g_bSuspended)
            {
                //
                // Yes - the state changed so update the display.
                //
                bLastSuspend = g_bSuspended;
                GrContextFontSet(&g_sContext, &g_sFontCmss22b);
                GrStringDrawCentered(&g_sContext,
                                     (bLastSuspend ? " Bus suspended...  ":
                                                     " Host connected... "),
                                     -1, lCenterX, 40, true);
                DEBUG_PRINT(bLastSuspend ? "Bus suspended.\n" :
                            "Bus resumed.\n");
            }

            //
            // Do we have any touchscreen input to process?
            //
            if(g_ulCommand)
            {
                //
                // Take a snapshot of the commands we were sent then clear
                // the global command flags.
                //
                ulProcessing = g_ulCommand;
                g_ulCommand = 0;

                //
                // Is the bus currently suspended?
                //
                if(g_bSuspended)
                {
                    //
                    // We are suspended so request a remote wakeup.
                    //
                    USBDHIDKeyboardRemoteWakeupRequest(
                                                   (void *)&g_sKeyboardDevice);
                }

                //
                // Process the command unless we got simultaneous press and
                // release commands in which case we ignore them.
                //
                if(!((ulProcessing & (COMMAND_PRESS | COMMAND_RELEASE)) ==
                     (COMMAND_PRESS | COMMAND_RELEASE)))
                {
                    //
                    // Was the touchscreen pressed?
                    //
                    if(ulProcessing & COMMAND_PRESS)
                    {
                        //
                        // Map the touchscreen press to an actual key in the
                        // virtual keyboard.
                        //
                        bRetcode = FindVirtualKey(g_sXPress, g_sYPress,
                                                 &g_sFocusCol, &g_sFocusRow);
                        if(!bRetcode)
                        {
                            //
                            // The press was outside any key on the virtual
                            // keyboard so just go back and wait for something
                            // else to happen.
                            //
                            continue;
                        }

                        //
                        // A key is pressed.
                        //
                        bKeyPressed = true;
                    }

                    //
                    // Pass information on the press or release to the host,
                    // making sure we only send a message if we really saw a
                    // change of state.
                    //
                    if(bKeyPressed)
                    {
                        bRetcode = VirtualKeyboardKeyPress(g_sFocusCol, g_sFocusRow,
                                           ((ulProcessing == COMMAND_PRESS) ?
                                           true : false));
                    }
                    else
                    {
                        bRetcode = true;
                    }

                    //
                    // Remember that no key is currently pressed.
                    //
                    if(ulProcessing & COMMAND_RELEASE)
                    {
                        bKeyPressed = false;
                    }

                    //
                    // If the key press generated an error, this likely
                    // indicates that the host has disconnected so drop out of
                    // the loop and go back to looking for a new connection.
                    //
                    if(!bRetcode)
                    {
                        break;
                    }
                }
            }

            //
            // Update the state if the host set the LEDs since we last looked.
            //
            if(g_bLEDStateChanged)
            {
                KeyboardLEDsChanged();
            }

            //
            // Wait for at least 1 system tick to have gone by before we poll
            // the buttons again.
            //
            while(g_ulSysTickCount == ulLastTickCount)
            {
                //
                // Hang around doing nothing.
                //
            }
        }

        //
        // Dropping out of the previous loop indicates that the host has
        // disconnected so go back and wait for reconnection.
        //
        DEBUG_PRINT("Host disconnected.\n");
    }
}

//*****************************************************************************
//
// This is the interrupt handler for the SysTick interrupt.  It is used to
// update our local tick count which, in turn, is used to check for transmit
// timeouts.
//
//*****************************************************************************
void
SysTickIntHandler(void)
{
    g_ulSysTickCount++;
}
